# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [5]:
cur.execute('''SELECT * FROM sqlite_master WHERE type='table' AND tbl_name='employees';''').fetchall()

[('table',
  'employees',
  'employees',
  56,
  'CREATE TABLE `employees` (`employeeNumber`, `lastName`, `firstName`, `extension`, `email`, `officeCode`, `reportsTo`, `jobTitle`)')]

In [7]:
cur.execute('''SELECT * FROM sqlite_master WHERE type='table' AND tbl_name='offices';''').fetchall()

[('table',
  'offices',
  'offices',
  32,
  'CREATE TABLE `offices` (`officeCode`, `city`, `phone`, `addressLine1`, `addressLine2`, `state`, `country`, `postalCode`, `territory`)')]

In [37]:
cur.execute('''SELECT city FROM offices LIMIT 10;''').fetchall()

[('San Francisco',),
 ('Boston',),
 ('NYC',),
 ('Paris',),
 ('Tokyo',),
 ('Sydney',),
 ('London',)]

## Do any offices have no employees?

In [43]:
cur.execute('''SELECT city, lastName FROM offices LEFT JOIN employees USING (officeCode);''').fetchall()

[('San Francisco', 'Bow'),
 ('San Francisco', 'Firrelli'),
 ('San Francisco', 'Jennings'),
 ('San Francisco', 'Murphy'),
 ('San Francisco', 'Patterson'),
 ('San Francisco', 'Thompson'),
 ('Boston', 'Firrelli'),
 ('Boston', 'Patterson'),
 ('NYC', 'Tseng'),
 ('NYC', 'Vanauf'),
 ('Paris', 'Bondur'),
 ('Paris', 'Bondur'),
 ('Paris', 'Castillo'),
 ('Paris', 'Gerard'),
 ('Paris', 'Hernandez'),
 ('Tokyo', 'Kato'),
 ('Tokyo', 'Nishi'),
 ('Sydney', 'Fixter'),
 ('Sydney', 'King'),
 ('Sydney', 'Marsh'),
 ('Sydney', 'Patterson'),
 ('London', 'Bott'),
 ('London', 'Jones')]

In [44]:
#Your code here
cur.execute('''SELECT city, count(*) FROM offices LEFT JOIN employees USING (officeCode) GROUP BY city ORDER BY COUNT(*) DESC;''')
df= pd.DataFrame(cur.fetchall())
df

               0  1
0  San Francisco  6
1          Paris  5
2         Sydney  4
3         Boston  2
4         London  2
5            NYC  2
6          Tokyo  2

## Write 3 Questions of your own and answer them

In [58]:
# How many orders by product line?
cur.execute('''SELECT productLine, count(*) FROM productlines 
                                    JOIN products USING (productLine)
                                    JOIN orderdetails USING (productCode)
                                    GROUP BY productLine
                                    ORDER BY count(*) DESC;''').fetchall()

[('Classic Cars', 1010),
 ('Vintage Cars', 657),
 ('Motorcycles', 359),
 ('Planes', 336),
 ('Trucks and Buses', 308),
 ('Ships', 245),
 ('Trains', 81)]

In [68]:
# list number of employees per territory?
cur.execute('''SELECT territory, count(*) FROM 
                    employees JOIN offices USING (officeCode)
                    GROUP BY territory
                    ORDER BY count(*) DESC;''').fetchall()

[('NA', 10), ('EMEA', 7), ('APAC', 4), ('Japan', 2)]

In [74]:
# Check by counting manually
cur.execute('''SELECT territory, lastName FROM 
                    employees JOIN offices USING (officeCode);''').fetchall()

[('NA', 'Murphy'),
 ('NA', 'Patterson'),
 ('NA', 'Firrelli'),
 ('APAC', 'Patterson'),
 ('EMEA', 'Bondur'),
 ('NA', 'Bow'),
 ('NA', 'Jennings'),
 ('NA', 'Thompson'),
 ('NA', 'Firrelli'),
 ('NA', 'Patterson'),
 ('NA', 'Tseng'),
 ('NA', 'Vanauf'),
 ('EMEA', 'Bondur'),
 ('EMEA', 'Hernandez'),
 ('EMEA', 'Castillo'),
 ('EMEA', 'Bott'),
 ('EMEA', 'Jones'),
 ('APAC', 'Fixter'),
 ('APAC', 'Marsh'),
 ('APAC', 'King'),
 ('Japan', 'Nishi'),
 ('Japan', 'Kato'),
 ('EMEA', 'Gerard')]

## Level Up: Display the names of each product each employee has sold.

In [48]:
# Your code here
cur.execute('''SELECT firstName, lastName, productName FROM 
                            employees e JOIN customers c ON e.employeeNumber=c.salesRepEmployeeNumber
                            JOIN orders o USING (customerNumber)
                            JOIN orderdetails od USING (orderNumber)
                            JOIN products p USING (productCode) LIMIT 15;''')
df=pd.DataFrame(cur.fetchall())
df.head()

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [55]:
#Your code here
cur.execute('''SELECT firstName, lastName, count(*) FROM 
                            employees e JOIN customers c ON e.employeeNumber=c.salesRepEmployeeNumber
                            JOIN orders o USING (customerNumber)
                            JOIN orderdetails od USING (orderNumber)
                            JOIN products p USING (productCode) 
                            GROUP BY employeeNumber
                            ORDER BY count(*) DESC;''')
df=pd.DataFrame(cur.fetchall())
df

           0          1    2
0     Gerard  Hernandez  396
1     Leslie   Jennings  331
2     Pamela   Castillo  272
3      Larry       Bott  236
4      Barry      Jones  220
5     George     Vanauf  211
6       Andy     Fixter  185
7      Peter      Marsh  185
8       Loui     Bondur  177
9      Steve  Patterson  152
10  Foon Yue      Tseng  142
11      Mami      Nishi  137
12     Julie   Firrelli  124
13    Leslie   Thompson  114
14    Martin     Gerard  114

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!